_protected/models/CategoryQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `category`