_protected/models/FixedAssetsQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `fixed_assets`